{
  "projects": [
    {
      "title": "MedLab Help",
      "description": "Medlab Help is a full-stack user-friendly web app that simplifies medical jargon, with a focus on routine medical tests. Following RESTful API principles, it efficiently retrieves lab test data from PostgreSQL, aggregating over 100 records from external CSV files. The responsive design guarantees a smooth user experience, while the advanced search feature, driven by React's 'useState' and 'filter' method, empowers users to effortlessly query specific test names, panels, or organs. Medlab Help stands out as a concise and robust tool for accessing and comprehending essential medical test information.",
      "image": "./images/medLabHelp.png",
      "demoLink": "https://www.youtube.com/watch?v=NYpxci2isuI",
      "githubLink": "https://github.com/Kguarnizo/Full-Stack-MedLab-Help",
      "techStack": [
        "Python",
        "Django",
        "PostgreSQL",
        "TypeScript",
        "React",
        "Bootstrap",
        "HTML",
        "CSS"
      ]
    },
    {
      "title": "Inspiration Board",
      "description": "Inspiration Board, a full-stack web app, enables users to create, view, and manage inspiration boards with detailed cards. RESTful API conventions are followed for adding, editing, deleting cards, and giving +1 likes. Error handling for `axios.post` requests capture and update state with API validation errors, showcasing informative error messages through a dedicated error component. Key functionality includes sorting cards in ascending order by properties (message, ID, likes). Users can easily select sorting criteria via a dropdown menu, dynamically re-rendering the sorted card array. This enhances user experience with clear error feedback and flexible data organization.",
      "image": "./images/inspirationBoard.png",
      "demoLink": "https://www.youtube.com/watch?v=5aVJHeXpJB8",
      "githubLink": "https://github.com/Kguarnizo/Full-Stack-Inspiration-Board",
      "techStack": [
        "Python",
        "Flask",
        "SQLAlchemy",
        "PostgreSQL",
        "Javascript",
        "React",
        "HTML",
        "CSS"
      ]
    }
  ]
}
